import codecs
import json

origin_data = {"data1": [[0.735, 0.301, 1, "安徽省", "省份：安徽省; GDP相对值：0.301; 教育相对值：0.735"],
                         [0.562, 0.312, 1, "北京市", "省份：北京市; GDP相对值：0.312; 教育相对值：0.562"],
                         [0.543, 0.359, 1, "福建省", "省份：福建省; GDP相对值：0.359; 教育相对值：0.543"],
                         [0.278, 0.083, 1, "甘肃省", "省份：甘肃省; GDP相对值：0.083; 教育相对值：0.278"],
                         [0.877, 1.0, 1, "广东省", "省份：广东省; GDP相对值：1.0; 教育相对值：0.877"],
                         [0.438, 0.206, 1, "广西壮族自治区", "省份：广西壮族自治区; GDP相对值：0.206; 教育相对值：0.438"],
                         [0.352, 0.151, 1, "贵州省", "省份：贵州省; GDP相对值：0.151; 教育相对值：0.352"],
                         [0.105, 0.05, 1, "海南省", "省份：海南省; GDP相对值：0.05; 教育相对值：0.105"],
                         [0.735, 0.379, 1, "河北省", "省份：河北省; GDP相对值：0.379; 教育相对值：0.735"],
                         [0.796, 0.497, 1, "河南省", "省份：河南省; GDP相对值：0.497; 教育相对值：0.796"],
                         [0.5, 0.177, 1, "黑龙江省", "省份：黑龙江省; GDP相对值：0.177; 教育相对值：0.5"],
                         [0.759, 0.395, 1, "湖北省", "省份：湖北省; GDP相对值：0.395; 教育相对值：0.759"],
                         [0.772, 0.378, 1, "湖南省", "省份：湖南省; GDP相对值：0.378; 教育相对值：0.772"],
                         [0.358, 0.167, 1, "吉林省", "省份：吉林省; GDP相对值：0.167; 教育相对值：0.358"],
                         [1.0, 0.957, 1, "江苏省", "省份：江苏省; GDP相对值：0.957; 教育相对值：1.0"],
                         [0.599, 0.223, 1, "江西省", "省份：江西省; GDP相对值：0.223; 教育相对值：0.599"],
                         [0.716, 0.261, 1, "辽宁省", "省份：辽宁省; GDP相对值：0.261; 教育相对值：0.716"],
                         [0.327, 0.179, 1, "内蒙古自治区", "省份：内蒙古自治区; GDP相对值：0.179; 教育相对值：0.327"],
                         [0.111, 0.038, 1, "宁夏回族自治区", "省份：宁夏回族自治区; GDP相对值：0.038; 教育相对值：0.111"],
                         [0.074, 0.029, 1, "青海省", "省份：青海省; GDP相对值：0.029; 教育相对值：0.074"],
                         [0.883, 0.81, 1, "山东省", "省份：山东省; GDP相对值：0.81; 教育相对值：0.883"],
                         [0.488, 0.173, 1, "山西省", "省份：山西省; GDP相对值：0.173; 教育相对值：0.488"],
                         [0.574, 0.244, 1, "陕西省", "省份：陕西省; GDP相对值：0.244; 教育相对值：0.574"],
                         [0.42, 0.341, 1, "上海市", "省份：上海市; GDP相对值：0.341; 教育相对值：0.42"],
                         [0.673, 0.412, 1, "四川省", "省份：四川省; GDP相对值：0.412; 教育相对值：0.673"],
                         [0.0, 0.0, 1, "台湾省", "省份：台湾省; GDP相对值：0.0; 教育相对值：0.0"],
                         [0.34, 0.207, 1, "天津市", "省份：天津市; GDP相对值：0.207; 教育相对值：0.34"],
                         [0.037, 0.015, 1, "西藏自治区", "省份：西藏自治区; GDP相对值：0.015; 教育相对值：0.037"],
                         [0.272, 0.121, 1, "新疆维吾尔自治区", "省份：新疆维吾尔自治区; GDP相对值：0.121; 教育相对值：0.272"],
                         [0.426, 0.183, 1, "云南省", "省份：云南省; GDP相对值：0.183; 教育相对值：0.426"],
                         [0.648, 0.577, 1, "浙江省", "省份：浙江省; GDP相对值：0.577; 教育相对值：0.648"],
                         [0.389, 0.217, 1, "重庆市", "省份：重庆市; GDP相对值：0.217; 教育相对值：0.389"]],
               "data2": [[0.155, 0.301, 2, "安徽省", "省份：安徽省; GDP相对值：0.301; 学者相对值：0.155"],
                         [1.0, 0.312, 2, "北京市", "省份：北京市; GDP相对值：0.312; 学者相对值：1.0"],
                         [0.112, 0.359, 2, "福建省", "省份：福建省; GDP相对值：0.359; 学者相对值：0.112"],
                         [0.0, 0.083, 2, "甘肃省", "省份：甘肃省; GDP相对值：0.083; 学者相对值：0.0"],
                         [0.339, 1.0, 2, "广东省", "省份：广东省; GDP相对值：1.0; 学者相对值：0.339"],
                         [0.0, 0.206, 2, "广西壮族自治区", "省份：广西壮族自治区; GDP相对值：0.206; 学者相对值：0.0"],
                         [0.0, 0.151, 2, "贵州省", "省份：贵州省; GDP相对值：0.151; 学者相对值：0.0"],
                         [0.0, 0.05, 2, "海南省", "省份：海南省; GDP相对值：0.05; 学者相对值：0.0"],
                         [0.147, 0.379, 2, "河北省", "省份：河北省; GDP相对值：0.379; 学者相对值：0.147"],
                         [0.178, 0.497, 2, "河南省", "省份：河南省; GDP相对值：0.497; 学者相对值：0.178"],
                         [0.189, 0.177, 2, "黑龙江省", "省份：黑龙江省; GDP相对值：0.177; 学者相对值：0.189"],
                         [0.326, 0.395, 2, "湖北省", "省份：湖北省; GDP相对值：0.395; 学者相对值：0.326"],
                         [0.213, 0.378, 2, "湖南省", "省份：湖南省; GDP相对值：0.378; 学者相对值：0.213"],
                         [0.144, 0.167, 2, "吉林省", "省份：吉林省; GDP相对值：0.167; 学者相对值：0.144"],
                         [0.495, 0.957, 2, "江苏省", "省份：江苏省; GDP相对值：0.957; 学者相对值：0.495"],
                         [0.0, 0.223, 2, "江西省", "省份：江西省; GDP相对值：0.223; 学者相对值：0.0"],
                         [0.262, 0.261, 2, "辽宁省", "省份：辽宁省; GDP相对值：0.261; 学者相对值：0.262"],
                         [0.0, 0.179, 2, "内蒙古自治区", "省份：内蒙古自治区; GDP相对值：0.179; 学者相对值：0.0"],
                         [0.0, 0.038, 2, "宁夏回族自治区", "省份：宁夏回族自治区; GDP相对值：0.038; 学者相对值：0.0"],
                         [0.0, 0.029, 2, "青海省", "省份：青海省; GDP相对值：0.029; 学者相对值：0.0"],
                         [0.277, 0.81, 2, "山东省", "省份：山东省; GDP相对值：0.81; 学者相对值：0.277"],
                         [0.0, 0.173, 2, "山西省", "省份：山西省; GDP相对值：0.173; 学者相对值：0.0"],
                         [0.296, 0.244, 2, "陕西省", "省份：陕西省; GDP相对值：0.244; 学者相对值：0.296"],
                         [0.441, 0.341, 2, "上海市", "省份：上海市; GDP相对值：0.341; 学者相对值：0.441"],
                         [0.296, 0.412, 2, "四川省", "省份：四川省; GDP相对值：0.412; 学者相对值：0.296"],
                         [0.156, 0.0, 2, "台湾省", "省份：台湾省; GDP相对值：0.0; 学者相对值：0.156"],
                         [0.17, 0.207, 2, "天津市", "省份：天津市; GDP相对值：0.207; 学者相对值：0.17"],
                         [0.0, 0.015, 2, "西藏自治区", "省份：西藏自治区; GDP相对值：0.015; 学者相对值：0.0"],
                         [0.0, 0.121, 2, "新疆维吾尔自治区", "省份：新疆维吾尔自治区; GDP相对值：0.121; 学者相对值：0.0"],
                         [0.0, 0.183, 2, "云南省", "省份：云南省; GDP相对值：0.183; 学者相对值：0.0"],
                         [0.272, 0.577, 2, "浙江省", "省份：浙江省; GDP相对值：0.577; 学者相对值：0.272"],
                         [0.132, 0.217, 2, "重庆市", "省份：重庆市; GDP相对值：0.217; 学者相对值：0.132"]],
               "data3": [[0.234, 0.301, 3, "安徽省", "省份：安徽省; GDP相对值：0.301; R&D经费相对值：0.234"],
                         [0.144, 0.312, 3, "北京市", "省份：北京市; GDP相对值：0.312; R&D经费相对值：0.144"],
                         [0.241, 0.359, 3, "福建省", "省份：福建省; GDP相对值：0.359; R&D经费相对值：0.241"],
                         [0.025, 0.083, 3, "甘肃省", "省份：甘肃省; GDP相对值：0.083; R&D经费相对值：0.025"],
                         [1.0, 1.0, 3, "广东省", "省份：广东省; GDP相对值：1.0; R&D经费相对值：1.0"],
                         [0.05, 0.206, 3, "广西壮族自治区", "省份：广西壮族自治区; GDP相对值：0.206; R&D经费相对值：0.05"],
                         [0.035, 0.151, 3, "贵州省", "省份：贵州省; GDP相对值：0.151; R&D经费相对值：0.035"],
                         [0.004, 0.05, 3, "海南省", "省份：海南省; GDP相对值：0.05; R&D经费相对值：0.004"],
                         [0.188, 0.379, 3, "河北省", "省份：河北省; GDP相对值：0.379; R&D经费相对值：0.188"],
                         [0.253, 0.497, 3, "河南省", "省份：河南省; GDP相对值：0.497; R&D经费相对值：0.253"],
                         [0.044, 0.177, 3, "黑龙江省", "省份：黑龙江省; GDP相对值：0.177; R&D经费相对值：0.044"],
                         [0.251, 0.395, 3, "湖北省", "省份：湖北省; GDP相对值：0.395; R&D经费相对值：0.251"],
                         [0.248, 0.378, 3, "湖南省", "省份：湖南省; GDP相对值：0.378; R&D经费相对值：0.248"],
                         [0.04, 0.167, 3, "吉林省", "省份：吉林省; GDP相对值：0.167; R&D经费相对值：0.04"],
                         [0.983, 0.957, 3, "江苏省", "省份：江苏省; GDP相对值：0.957; R&D经费相对值：0.983"],
                         [0.119, 0.223, 3, "江西省", "省份：江西省; GDP相对值：0.223; R&D经费相对值：0.119"],
                         [0.147, 0.261, 3, "辽宁省", "省份：辽宁省; GDP相对值：0.261; R&D经费相对值：0.147"],
                         [0.058, 0.179, 3, "内蒙古自治区", "省份：内蒙古自治区; GDP相对值：0.179; R&D经费相对值：0.058"],
                         [0.016, 0.038, 3, "宁夏回族自治区", "省份：宁夏回族自治区; GDP相对值：0.038; R&D经费相对值：0.016"],
                         [0.004, 0.029, 3, "青海省", "省份：青海省; GDP相对值：0.029; R&D经费相对值：0.004"],
                         [0.838, 0.81, 3, "山东省", "省份：山东省; GDP相对值：0.81; R&D经费相对值：0.838"],
                         [0.06, 0.173, 3, "山西省", "省份：山西省; GDP相对值：0.173; R&D经费相对值：0.06"],
                         [0.105, 0.244, 3, "陕西省", "省份：陕西省; GDP相对值：0.244; R&D经费相对值：0.105"],
                         [0.29, 0.341, 3, "上海市", "省份：上海市; GDP相对值：0.341; R&D经费相对值：0.29"],
                         [0.161, 0.412, 3, "四川省", "省份：四川省; GDP相对值：0.412; R&D经费相对值：0.161"],
                         [0.0, 0.0, 3, "台湾省", "省份：台湾省; GDP相对值：0.0; R&D经费相对值：0.0"],
                         [0.129, 0.207, 3, "天津市", "省份：天津市; GDP相对值：0.207; R&D经费相对值：0.129"],
                         [0.0, 0.015, 3, "西藏自治区", "省份：西藏自治区; GDP相对值：0.015; R&D经费相对值：0.0"],
                         [0.021, 0.121, 3, "新疆维吾尔自治区", "省份：新疆维吾尔自治区; GDP相对值：0.121; R&D经费相对值：0.021"],
                         [0.047, 0.183, 3, "云南省", "省份：云南省; GDP相对值：0.183; R&D经费相对值：0.047"],
                         [0.552, 0.577, 3, "浙江省", "省份：浙江省; GDP相对值：0.577; R&D经费相对值：0.552"],
                         [0.15, 0.217, 3, "重庆市", "省份：重庆市; GDP相对值：0.217; R&D经费相对值：0.15"]],
               "data4": [[0.254, 0.301, 4, "安徽省", "省份：安徽省; GDP相对值：0.301; 科技相对值：0.175"],
                         [0.959, 0.312, 4, "北京市", "省份：北京市; GDP相对值：0.312; 科技相对值：0.661"],
                         [0.248, 0.359, 4, "福建省", "省份：福建省; GDP相对值：0.359; 科技相对值：0.171"],
                         [0.022, 0.083, 4, "甘肃省", "省份：甘肃省; GDP相对值：0.083; 科技相对值：0.015"],
                         [1.0, 1.0, 4, "广东省", "省份：广东省; GDP相对值：1.0; 科技相对值：0.689"],
                         [0.033, 0.206, 4, "广西壮族自治区", "省份：广西壮族自治区; GDP相对值：0.206; 科技相对值：0.023"],
                         [0.028, 0.151, 4, "贵州省", "省份：贵州省; GDP相对值：0.151; 科技相对值：0.019"],
                         [0.004, 0.05, 4, "海南省", "省份：海南省; GDP相对值：0.05; 科技相对值：0.003"],
                         [0.19, 0.379, 4, "河北省", "省份：河北省; GDP相对值：0.379; 科技相对值：0.131"],
                         [0.277, 0.497, 4, "河南省", "省份：河南省; GDP相对值：0.497; 科技相对值：0.191"],
                         [0.183, 0.177, 4, "黑龙江省", "省份：黑龙江省; GDP相对值：0.177; 科技相对值：0.126"],
                         [0.347, 0.395, 4, "湖北省", "省份：湖北省; GDP相对值：0.395; 科技相对值：0.239"],
                         [0.26, 0.378, 4, "湖南省", "省份：湖南省; GDP相对值：0.378; 科技相对值：0.179"],
                         [0.126, 0.167, 4, "吉林省", "省份：吉林省; GDP相对值：0.167; 科技相对值：0.087"],
                         [0.89, 0.957, 4, "江苏省", "省份：江苏省; GDP相对值：0.957; 科技相对值：0.613"],
                         [0.073, 0.223, 4, "江西省", "省份：江西省; GDP相对值：0.223; 科技相对值：0.05"],
                         [0.255, 0.261, 4, "辽宁省", "省份：辽宁省; GDP相对值：0.261; 科技相对值：0.176"],
                         [0.013, 0.179, 4, "内蒙古自治区", "省份：内蒙古自治区; GDP相对值：0.179; 科技相对值：0.009"],
                         [0.009, 0.038, 4, "宁夏回族自治区", "省份：宁夏回族自治区; GDP相对值：0.038; 科技相对值：0.006"],
                         [0.003, 0.029, 4, "青海省", "省份：青海省; GDP相对值：0.029; 科技相对值：0.002"],
                         [0.431, 0.81, 4, "山东省", "省份：山东省; GDP相对值：0.81; 科技相对值：0.297"],
                         [0.025, 0.173, 4, "山西省", "省份：山西省; GDP相对值：0.173; 科技相对值：0.017"],
                         [0.309, 0.244, 4, "陕西省", "省份：陕西省; GDP相对值：0.244; 科技相对值：0.213"],
                         [0.483, 0.341, 4, "上海市", "省份：上海市; GDP相对值：0.341; 科技相对值：0.333"],
                         [0.361, 0.412, 4, "四川省", "省份：四川省; GDP相对值：0.412; 科技相对值：0.249"],
                         [0.138, 0.0, 4, "台湾省", "省份：台湾省; GDP相对值：0.0; 科技相对值：0.095"],
                         [0.212, 0.207, 4, "天津市", "省份：天津市; GDP相对值：0.207; 科技相对值：0.146"],
                         [0.001, 0.015, 4, "西藏自治区", "省份：西藏自治区; GDP相对值：0.015; 科技相对值：0.001"],
                         [0.017, 0.121, 4, "新疆维吾尔自治区", "省份：新疆维吾尔自治区; GDP相对值：0.121; 科技相对值：0.012"],
                         [0.03, 0.183, 4, "云南省", "省份：云南省; GDP相对值：0.183; 科技相对值：0.021"],
                         [0.676, 0.577, 4, "浙江省", "省份：浙江省; GDP相对值：0.577; 科技相对值：0.466"],
                         [0.179, 0.217, 4, "重庆市", "省份：重庆市; GDP相对值：0.217; 科技相对值：0.123"]],
               "data5": [[0.317, 0.301, 5, "安徽省", "省份：安徽省; GDP相对值：0.301; 公民科学素质相对值：0.175"],
                         [0.939, 0.312, 5, "北京市", "省份：北京市; GDP相对值：0.312; 公民科学素质相对值：0.661"],
                         [0.326, 0.359, 5, "福建省", "省份：福建省; GDP相对值：0.359; 公民科学素质相对值：0.171"],
                         [0.211, 0.083, 5, "甘肃省", "省份：甘肃省; GDP相对值：0.083; 公民科学素质相对值：0.015"],
                         [0.369, 1.0, 5, "广东省", "省份：广东省; GDP相对值：1.0; 公民科学素质相对值：0.689"],
                         [0.227, 0.206, 5, "广西壮族自治区", "省份：广西壮族自治区; GDP相对值：0.206; 公民科学素质相对值：0.023"],
                         [0.19, 0.151, 5, "贵州省", "省份：贵州省; GDP相对值：0.151; 公民科学素质相对值：0.019"],
                         [0.175, 0.05, 5, "海南省", "省份：海南省; GDP相对值：0.05; 公民科学素质相对值：0.003"],
                         [0.282, 0.379, 5, "河北省", "省份：河北省; GDP相对值：0.379; 公民科学素质相对值：0.131"],
                         [0.299, 0.497, 5, "河南省", "省份：河南省; GDP相对值：0.497; 公民科学素质相对值：0.191"],
                         [0.271, 0.177, 5, "黑龙江省", "省份：黑龙江省; GDP相对值：0.177; 公民科学素质相对值：0.126"],
                         [0.292, 0.395, 5, "湖北省", "省份：湖北省; GDP相对值：0.395; 公民科学素质相对值：0.239"],
                         [0.275, 0.378, 5, "湖南省", "省份：湖南省; GDP相对值：0.378; 公民科学素质相对值：0.179"],
                         [0.319, 0.167, 5, "吉林省", "省份：吉林省; GDP相对值：0.167; 公民科学素质相对值：0.087"],
                         [0.441, 0.957, 5, "江苏省", "省份：江苏省; GDP相对值：0.957; 公民科学素质相对值：0.613"],
                         [0.273, 0.223, 5, "江西省", "省份：江西省; GDP相对值：0.223; 公民科学素质相对值：0.05"],
                         [0.305, 0.261, 5, "辽宁省", "省份：辽宁省; GDP相对值：0.261; 公民科学素质相对值：0.176"],
                         [0.275, 0.179, 5, "内蒙古自治区", "省份：内蒙古自治区; GDP相对值：0.179; 公民科学素质相对值：0.009"],
                         [0.214, 0.038, 5, "宁夏回族自治区", "省份：宁夏回族自治区; GDP相对值：0.038; 公民科学素质相对值：0.006"],
                         [0.173, 0.029, 5, "青海省", "省份：青海省; GDP相对值：0.029; 公民科学素质相对值：0.002"],
                         [0.361, 0.81, 5, "山东省", "省份：山东省; GDP相对值：0.81; 公民科学素质相对值：0.297"],
                         [0.282, 0.173, 5, "山西省", "省份：山西省; GDP相对值：0.173; 公民科学素质相对值：0.017"],
                         [0.294, 0.244, 5, "陕西省", "省份：陕西省; GDP相对值：0.244; 公民科学素质相对值：0.213"],
                         [1.0, 0.341, 5, "上海市", "省份：上海市; GDP相对值：0.341; 公民科学素质相对值：0.333"],
                         [0.25, 0.412, 5, "四川省", "省份：四川省; GDP相对值：0.412; 公民科学素质相对值：0.249"],
                         [0.0, 0.0, 5, "台湾省", "省份：台湾省; GDP相对值：0.0; 公民科学素质相对值：0.095"],
                         [0.641, 0.207, 5, "天津市", "省份：天津市; GDP相对值：0.207; 公民科学素质相对值：0.146"],
                         [0.103, 0.015, 5, "西藏自治区", "省份：西藏自治区; GDP相对值：0.015; 公民科学素质相对值：0.001"],
                         [0.212, 0.121, 5, "新疆维吾尔自治区", "省份：新疆维吾尔自治区; GDP相对值：0.121; 公民科学素质相对值：0.012"],
                         [0.176, 0.183, 5, "云南省", "省份：云南省; GDP相对值：0.183; 公民科学素质相对值：0.021"],
                         [0.439, 0.577, 5, "浙江省", "省份：浙江省; GDP相对值：0.577; 公民科学素质相对值：0.466"],
                         [0.253, 0.217, 5, "重庆市", "省份：重庆市; GDP相对值：0.217; 公民科学素质相对值：0.123"]]}
return_data = []

def para_1():
    #[{"name": "安徽", "data": [[0.735, 0.301, "教育水平"], [0.155, 0.301, "学者数量"], [0.234, 0.301, "R&D经费投入"], [0.254, 0.301, "科技创新水平"]]}]
    for edu_province in origin_data['data1']:
        province_name = edu_province[3]
        if province_name == '广西壮族自治区':
            province_name = '广西'
        elif province_name == '内蒙古自治区':
            province_name = '内蒙古'
        elif province_name == '宁夏回族自治区':
            province_name = '宁夏'
        elif province_name == '西藏自治区':
            province_name = '西藏'
        elif province_name == '新疆维吾尔自治区':
            province_name = '新疆'
        else:
            province_name = province_name.replace('省', '')
            province_name = province_name.replace('市', '')
        return_data.append({'name':province_name, 'data':[[edu_province[0], edu_province[1], '教育水平']]})

    for pointer in range(len(origin_data['data2'])):
        return_data[pointer]['data'].append([origin_data['data2'][pointer][0], origin_data['data2'][pointer][1], '学者数量'])

    for pointer in range(len(origin_data['data3'])):
        return_data[pointer]['data'].append([origin_data['data3'][pointer][0], origin_data['data3'][pointer][1], 'R&D经费投入'])

    for pointer in range(len(origin_data['data3'])):
        return_data[pointer]['data'].append([origin_data['data4'][pointer][0], origin_data['data4'][pointer][1], '科技创新水平'])


    json.dump(return_data, codecs.open('./five_wei.json',  'w', encoding='utf-8'), ensure_ascii=False)


def para_2():
    # [{"name": "安徽", "data": [[0.735, 0.301, "教育水平"], [0.155, 0.301, "学者数量"], [0.234, 0.301, "R&D经费投入"], [0.254, 0.301, "科技创新水平"]]}]
    for edu_province in origin_data['data1']:
        province_name = edu_province[3]
        if province_name == '广西壮族自治区':
            province_name = '广西'
        elif province_name == '内蒙古自治区':
            province_name = '内蒙古'
        elif province_name == '宁夏回族自治区':
            province_name = '宁夏'
        elif province_name == '西藏自治区':
            province_name = '西藏'
        elif province_name == '新疆维吾尔自治区':
            province_name = '新疆'
        else:
            province_name = province_name.replace('省', '')
            province_name = province_name.replace('市', '')
        return_data.append({'name': province_name,'all_name':edu_province[3], 'label':'教育水平', 'data': [[edu_province[0], edu_province[1], edu_province[3], '教育水平']]})

    for edu_province in origin_data['data2']:
        province_name = edu_province[3]
        if province_name == '广西壮族自治区':
            province_name = '广西'
        elif province_name == '内蒙古自治区':
            province_name = '内蒙古'
        elif province_name == '宁夏回族自治区':
            province_name = '宁夏'
        elif province_name == '西藏自治区':
            province_name = '西藏'
        elif province_name == '新疆维吾尔自治区':
            province_name = '新疆'
        else:
            province_name = province_name.replace('省', '')
            province_name = province_name.replace('市', '')
        return_data.append({'name': province_name,'all_name':edu_province[3], 'label':'学者数量', 'data': [[edu_province[0], edu_province[1], edu_province[3], '学者数量']]})

    for edu_province in origin_data['data3']:
        province_name = edu_province[3]
        if province_name == '广西壮族自治区':
            province_name = '广西'
        elif province_name == '内蒙古自治区':
            province_name = '内蒙古'
        elif province_name == '宁夏回族自治区':
            province_name = '宁夏'
        elif province_name == '西藏自治区':
            province_name = '西藏'
        elif province_name == '新疆维吾尔自治区':
            province_name = '新疆'
        else:
            province_name = province_name.replace('省', '')
            province_name = province_name.replace('市', '')
        return_data.append({'name': province_name,'all_name':edu_province[3], 'label':'R&D经费投入', 'data': [[edu_province[0], edu_province[1], edu_province[3], 'R&D经费投入']]})

    for edu_province in origin_data['data4']:
        province_name = edu_province[3]
        if province_name == '广西壮族自治区':
            province_name = '广西'
        elif province_name == '内蒙古自治区':
            province_name = '内蒙古'
        elif province_name == '宁夏回族自治区':
            province_name = '宁夏'
        elif province_name == '西藏自治区':
            province_name = '西藏'
        elif province_name == '新疆维吾尔自治区':
            province_name = '新疆'
        else:
            province_name = province_name.replace('省', '')
            province_name = province_name.replace('市', '')
        return_data.append({'name': province_name,'all_name':edu_province[3], 'label':'科技创新水平', 'data': [[edu_province[0], edu_province[1], edu_province[3], '科技创新水平']]})

    for edu_province in origin_data['data5']:
        province_name = edu_province[3]
        if province_name == '广西壮族自治区':
            province_name = '广西'
        elif province_name == '内蒙古自治区':
            province_name = '内蒙古'
        elif province_name == '宁夏回族自治区':
            province_name = '宁夏'
        elif province_name == '西藏自治区':
            province_name = '西藏'
        elif province_name == '新疆维吾尔自治区':
            province_name = '新疆'
        else:
            province_name = province_name.replace('省', '')
            province_name = province_name.replace('市', '')
        return_data.append({'name': province_name,'all_name':edu_province[3], 'label':'公民科学素质', 'data': [[edu_province[0], edu_province[1], edu_province[3], '公民科学素质']]})

    json.dump(return_data, codecs.open('./five_wei.json', 'w', encoding='utf-8'), ensure_ascii=False)

if __name__ == '__main__':
    para_2()